Repository: OpenEdition/bilbo
Catalog: dependencies/PyXML-0.8.4/xml/dom/*.po
Languages: de

source: Attempt to modify a read-only object
de: Änderung eines unveränderbaren Objekts versucht.

source: Node manipulation results in invalid parent/child relationship.
de: Knotenänderung resultiert in ungültiger Eltern-Kind-Beziehung.

source: XML parse error at line %d, column %d: %s
de: XML-Parser-Fehler in Zeile %d, Spalte %d: %s

source: Node does not support data
de: Knoten unterstützt keine Daten.

source: DOMString exceeds maximum size
de: Der DOMString ist größer als maximal erlaubt.

source: Object does not support this operation or parameter
de: Das Objekt unterstützt diese Operation oder diesen Parameter nicht.

source: Uninitialized type in Event object
de: Nicht-initialisierter Typ in Event-Objekt.

source: Object or operation not supported
de: Das Objekt oder die Operation ist nicht unterstützt.

source: Invalid or illegal character
de: Ungültiges oder unerlaubtes Zeichen.

source: Node is from a different document
de: Der Knoten stammt aus einem anderen Dokument.

source: Attribute already in use by an element
de: Das Attribut wird bereits von einem Element verwendet.

source: Invalid Container Node
de: Ungültiger Container-Knoten.

source: Object is not, or is no longer, usable
de: Das Objekt ist nicht oder nicht mehr nutzbar.

source: Invalid or illegal namespace operation
de: Ungültige oder unerlaubte Namespace-Operation.

source: Specified string is invalid or illegal
de: Der angegebene String ist ungültig oder nicht erlaubt.

source: Index error accessing NodeList or NamedNodeMap
de: Indexfehler bei Zugriff auf NodeList- oder NamedNodeMap-Objekt.

source: Attempt to modify the type of a node
de: Typänderung eines Knotens versucht.

source: Invalid Boundary Points specified for Range
de: Ungültige Endpunkte für Range angegeben.

source: Node does not exist in this context
de: Knoten existiert in diesem Kontext nicht.
